package hello.week5;

import java.util.Scanner;

public class List_5_3 {
	/*================二维数组================
	 * int[][] a =new [3][5] 
	 * a是一个3行5列的矩阵
	 * for(i=0;i<3;i++){
	 * 		for(i=0;i<5;i++){
	 * 			a[i][j]=i*j;
	 * 		}
	 * }
	 * 
	 *  a[i][j]是一个int
	 *  表示第i行第j列
	 *  a[i,j]并不存在，是数学上的写法，计算机不认识
	 *  
	 * ================初始化================
	 * int[][] a ={
	 * 	{1,2,3,4},
	 * 	{1,2,3},
	 * };
	 *  
	 * 编译器来数数
	 * 每行一个{}，逗号分隔
	 * 最后的逗号可以存在，古老的传统
	 * 如果省略，表示补零
	 *  
	 * */
	
	public static void main(String[] args) {
		/*井字棋游戏
		 *
		 *读入一个3*3的矩阵
		 *矩阵中的数字1表示位置是X，数字0表示为O
		 *
		 *程序判断矩阵中是否有获胜的一方，输出获胜方是X还是O，或者输出无人获胜
		 *获胜判断：
		 *1.行3个一样
		 *2.列3个一样
		 *3.对角3个一样
		 *4.反对角3个一样
		 */

		Scanner in =new Scanner(System.in);
		
		
		
		
	
	}
}